from fastapi import FastAPI

app = FastAPI()


schedule = {
    "group": "10903723",

    "schedule": [

        # =========================
        # ПОНЕДЕЛЬНИК
        # =========================

        {
            "day": "Понедельник",
            "time": "8:00–9:35",
            "name": "Основы управления интеллектуальной собственностью",
            "teacher": "Лесницкая В.А.",
            "room": "а453 к1",
            "week": 1
        },

        {
            "day": "Понедельник",
            "time": "8:00–9:35",
            "name": "Организация и управление предприятием (производством)",
            "teacher": "Барсуков А.А.",
            "room": "а307 к1",
            "week": 2
        },

        {
            "day": "Понедельник",
            "time": "9:55–11:30",
            "name": "Организация и управление предприятием (производством)",
            "teacher": "Барсуков А.А.",
            "room": "а312 к1",
            "week": None
        },

        {
            "day": "Понедельник",
            "time": "11:40–13:15",
            "name": "Защита населения",
            "teacher": "Тавгень Т.А.",
            "room": "а508 к18",
            "week": 1
        },


        # =========================
        # ВТОРНИК
        # =========================

        # Пар нет


        # =========================
        # СРЕДА
        # =========================

        {
            "day": "Среда",
            "time": "14:15–15:50",
            "name": "Основы интернета вещей",
            "teacher": "Михасик Е.И.",
            "room": "а308 к20",
            "week": None
        },

        {
            "day": "Среда",
            "time": "16:00–17:35",
            "name": "Основы интернета вещей",
            "teacher": "Михасик Е.И.",
            "room": "а308 к20",
            "week": 1
        },

        {
            "day": "Среда",
            "time": "16:00–17:35",
            "name": "Программные средства создания Интернет-приложений",
            "teacher": "Астапчик Н.И.",
            "room": "а308 к20",
            "week": 2
        },


        # =========================
        # ЧЕТВЕРГ
        # =========================

        {
            "day": "Четверг",
            "time": "8:00–9:35",
            "name": "Основы управления интеллектуальной собственностью",
            "teacher": "",
            "room": "",
            "week": 1
        },

        {
            "day": "Четверг",
            "time": "11:40–13:15",
            "name": "Экономика предприятия",
            "teacher": "Комина Н.В.",
            "room": "а437 к1",
            "week": None
        },

        {
            "day": "Четверг",
            "time": "13:55–15:30",
            "name": "Экономика предприятия",
            "teacher": "Самусенко Л.А.",
            "room": "а302 к9",
            "week": None
        },


        # =========================
        # ПЯТНИЦА
        # =========================

        {
            "day": "Пятница",
            "time": "10:25–12:00",
            "name": "Информационно-коммуникационные технологии",
            "teacher": "Малиновская Д.А.",
            "room": "а301 к20",
            "week": None
        },

        {
            "day": "Пятница",
            "time": "12:10–13:45",
            "name": "Верификация и аттестация ПО",
            "teacher": "Павловская К.В.",
            "room": "а601 к20",
            "week": 2
        },

        {
            "day": "Пятница",
            "time": "14:15–15:50",
            "name": "Информационно-коммуникативные технологии в образовании",
            "teacher": "Евтухова Т.Е.",
            "room": "а601 к20",
            "week": 1
        },

        {
            "day": "Пятница",
            "time": "14:15–15:50",
            "name": "Программные средства создания Интернет-приложений",
            "teacher": "Астапчик Н.И.",
            "room": "а601 к20",
            "week": 2
        },

        {
            "day": "Пятница",
            "time": "18:05–19:40",
            "name": "Программные средства",
            "teacher": "Василевская В.А.",
            "room": "а304 к20",
            "week": None
        },


        # =========================
        # СУББОТА
        # =========================

        {
            "day": "Суббота",
            "time": "12:10–13:45",
            "name": "Верификация и аттестация",
            "teacher": "Гала Е.В.",
            "room": "а303 к20",
            "week": 1
        },

        {
            "day": "Суббота",
            "time": "12:10–13:45",
            "name": "Программные средства",
            "teacher": "Василевская В.А.",
            "room": "а304 к20",
            "week": 2
        },

        {
            "day": "Суббота",
            "time": "14:15–15:50",
            "name": "Верификация и аттестация",
            "teacher": "Гала Е.В.",
            "room": "а303 к20",
            "week": 1
        },

        {
            "day": "Суббота",
            "time": "14:15–15:50",
            "name": "Программные средства",
            "teacher": "Василевская В.А.",
            "room": "а304 к20",
            "week": 2
        }
    ]
}


@app.get("/api/schedule/10903723")
def get_schedule():

    return schedule
